<?php
    $servername = "localhost";
    $username = "root";
    $password = "1234";
    $dbname = "myDB";
    
    // Create connection
    $conn = mysqli_connect($servername, $username, $password, "myDB");
    // Check connection
    if (!$conn) {
      die("Connection failed: " . mysqli_connect_error());
    }
    
    // sql to create table
    $sql = "CREATE TABLE area(
                area_name VARCHAR(30) NOT NULL
            );
            CREATE TABLE storeKind(
                store_kind VARCHAR(6) NOT NULL,
                food_type INT(6) UNSIGNED NOT NULL,
                reg_date TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
                );
            CREATE TABLE productInfo(
                product_id VARCHAR(6) NOT NULL,
                product_name VARCHAR(30) NOT NULL,
                price int(6) UNSIGNED NOT NULL,
                reg_date TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
                );
            CREATE TABLE customerInfo(
                customer_id INT(6) PRIMARY KEY,
                age INT(6) UNSIGNED NOT NULL,
                FOREIGN KEY (food_type) REFERENCES storeKind (food_type),
                reg_date TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
                );
            CREATE TABLE restAreaInfo(
                id VARCHAR(6) NOT NULL,
                ra_name VARCHAR(30) NOT NULL,
                FOREIGN KEY (area) REFERENCES area (area_name),
                ranking int(6) UNSIGNED NOT NULL,
                reg_date TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
                );
            CREATE TABLE storeInfo(
                FOREIGN KEY (RA_id) REFERENCES restareaInfo (id),
                store_id VARCHAR(6) NOT NULL,
                FOREIGN KEY (product_id) REFERENCES productInfo (product_id),
                store_name VARCHAR(30) NOT NULL,
                rank INT(6) UNSIGNED NOT NULL,
                FOREIGN KEY (food_type) REFERENCES foodType (food_type),
                reg_date TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
                );";

    $res = mysqli_multi_query($conn, $sql);
    if ($res === TRUE) {
        echo "Table created successfully";
        } else {
        echo "Error creating table: " . mysqli_error($conn);
        }
    mysqli_close($conn);
    
    $conn = mysqli_connect($servername, $username, $password, "myDB");
    // Check connection
    if (!$conn) {
      die("Connection failed: " . mysqli_connect_error());
    }
    //insert data
    $sql = "INSERT INTO area (area_name) VALUES
                ('서울경기'),('부산경상'),('강원'),('충청'),('전라');
            INSERT INTO restareaInfo (id, ra_name, area, ranking) VALUES
                ('RA01','시흥하늘휴게소','서울경기','1'),
                ('RA02','구리(일산)휴게소','서울경기','2'),
                ('RA03','죽전(서울)휴게소','서울경기','3'),
                ('RA04','선산(양평)휴게소','서울경기','4'),
                ('RA05','안성맞춤(평택)휴게소','서울경기','5'),
                ('RA06','통도사(부산)휴게소','부산경상','6'),
                ('RA07','사천(부산)휴게소','부산경상','7'),
                ('RA08','현풍(대구)휴게소','부산경상','8'),
                ('RA09','칠곡(부산)휴게소','부산경상','9'),
                ('RA10','영천(대구)휴게소','부산경상','10'),
                ('RA11','함평나비(광주)휴게소','전라','11'),
                ('RA12','정읍녹두장군(천안)휴게소','전라','12'),
                ('RA13','보성녹차(순천)휴게소','전라','13'),
                ('RA14','강천산(광주)휴게소','전라','14'),
                ('RA15','청주(서울)휴게소','충청','15'),
                ('RA16','옥산(부산)휴게소','충청','16'),
                ('RA17','공주(대전)휴게소','충청','17'),
                ('RA18','천등산(평택)휴게소','충청','18'),
                ('RA19','예산(당진)휴게소','충청','19'),
                ('RA20','내린천휴게소','강원','20'),
                ('RA21','홍천(양양)휴게소','강원','21'),
                ('RA22','문막(강릉)휴게소','강원','22'),
                ('RA23','옥계(속초)휴게소','강원','23'),
                ('RA24','평창(강릉)휴게소','강원','24');
            INSERT INTO customerInfo (customer_id, age, store_id) VALUES
                ('101','17','1002'),('102','46','1001'),('103','44','1005'),
                ('104','31','1002'),('105','31','1001'),('106','20','1005'),
                ('107','52','1001'),('108','25','1001'),('109','40','1003'),
                ('110','27','1002'),('111','35','1002'),('112','15','1008'),
                ('113','46','1001'),('114','20','1005'),('115','30','1003'),
                ('116','37','1001'),('117','40','1002'),('118','62','1001'),
                ('119','48','1001'),('120','55','1001'),('121','23','1005'),
                ('122','19','1002'),('123','31','1002'),('124','63','1001'),
                ('125','30','1006'),('126','22','1005'),('127','44','1001'),
                ('128','37','1005'),('129','17','1005'),('130','30','1001');
            INSERT INTO storeKind (store_kind, food_type) VALUES
                ('한식','1001'),('카페','1002'),('분식','1003'),
                ('기타','1004'),('간식','1005'),('편의점','1006'),
                ('중식','1007'),('양식','1008'),('기타','1009');
            INSERT INTO storeInfo (id, store_id, product_id, store_name, rank, food_type) VALUES
                ('RA01','S001','pd001','파리바게트','1','1002'),
                ('RA01','S002','pd002','찹쌀닭강정','2','1005'),
                ('RA01','S003','pd003','신서방왕만두','3','1003'),
                ('RA01','S004','pd004','CU','4','1006'),
                ('RA01','S005','pd005','효원당','5','1003'),
                ('RA02','S006','pd006','드롭탑','1','1002'),
                ('RA02','S007','pd007','델리쉐프','2','1005'),
                ('RA02','S008','pd008','델리쉐프','3','1005'),
                ('RA02','S009','pd009','만쥬리아','4','1005'),
                ('RA02','S010','pd010','델리쉐프','5','1005'),
                ('RA03','S011','pd011','자율식당','1','1001'),
                ('RA03','S012','pd005','호도과자코너','2','1005'),
                ('RA03','S013','pd012','우동전문점','3','1004'),
                ('RA03','S014','pd013','할리스커피','4','1002'),
                ('RA03','S015','pd014','자율식당','5','1001'),
                ('RA04','S016','pd013','카페드롭탑','1','1002'),
                ('RA04','S017','pd015','한식전문점','2','1001'),
                ('RA04','S018','pd016','한식전문점','3','1001'),
                ('RA04','S019','pd017','미스터짬뽕라면','4','1007'),
                ('RA04','S020','pd018','한식전문점','5','1001'),
                ('RA05','S021','pd019','한식전문점','1','1001'),
                ('RA05','S022','pd013','할리스','2','1002'),
                ('RA05','S023','pd020','로띠번','3','1002'),
                ('RA05','S024','pd007','가판','4','1003'),
                ('RA05','S025','pd022','한식당','5','1001'),
                ('RA06','S026','pd023','한식전문점','1','1001'),
                ('RA06','S027','pd024','한식전문점','2','1001'),
                ('RA06','S028','pd005','호두코너','3','1005'),
                ('RA06','S029','pd013','커피딜라이트','4','1002'),
                ('RA06','S030','pd025','한식전문점','5','1001'),
                ('RA07','S031','pd013','할리스커피','1','1002'),
                ('RA07','S032','pd026','한식전문점','2','1001'),
                ('RA07','S033','pd007','즉석코너','3','1003'),
                ('RA07','S034','pd027','한식전문점','4','1001'),
                ('RA07','S035','pd076','한식전문점','5','1001'),
                ('RA08','S036','pd028','풍경마루','1','1001'),
                ('RA08','S037','pd013','탐앤탐스','2','1002'),
                ('RA08','S038','pd029','풍경마루','3','1001'),
                ('RA08','S039','pd030','풍경마루','4','1001'),
                ('RA08','S040','pd031','코바코','5','1001'),
                ('RA09','S041','pd032','죠이마트','1','1006'),
                ('RA09','S042','pd033','자율식당','2','1001'),
                ('RA09','S043','pd034','우동김밥전문점','3','1003'),
                ('RA09','S044','pd005','호도/잡화','4','1005'),
                ('RA09','S045','pd035','자율식당','5','1001'),
                ('RA10','S046','pd013','탐앤탐스','1','1002'),
                ('RA10','S047','pd036','한식전문점','2','1001'),
                ('RA10','S048','pd037','한식전문점','3','1001'),
                ('RA10','S049','pd007','열린매장','4','1005'),
                ('RA10','S050','pd076','한식전문점','5','1001'),
                ('RA11','S051','pd013','탐앤탐스','1','1002'),
                ('RA11','S052','pd038','한식전문점','2','1001'),
                ('RA11','S053','pd039','한식전문점','3','1001'),
                ('RA11','S054','pd007','열린매장','4','1005'),
                ('RA11','S055','pd076','한식전문점','5','1001'),
                ('RA12','S056','pd013','탐앤탐스','1','1002'),
                ('RA12','S057','pd039','한식전문점','2','1001'),
                ('RA12','S058','pd040','한식전문점','3','1001'),
                ('RA12','S059','pd013','탐앤탐스','4','1002'),
                ('RA12','S060','pd041','한식전문점','5','1001'),
                ('RA13','S061','pd042','한식전문점','1','1001'),
                ('RA13','S062','pd013','할리스','2','1002'),
                ('RA13','S063','pd043','한식전문점','3','1001'),
                ('RA13','S064','pd044','미스터톡톡','4','1005'),
                ('RA13','S065','pd039','한식전문점','5','1001'),
                ('RA14','S066','pd045','한식전문점','1','1001'),
                ('RA14','S067','pd013','리던','2','1002'),
                ('RA14','S068','pd046','로띠번','3','1002'),
                ('RA14','S069','pd047','한식전문점','4','1001'),
                ('RA14','S070','pd007','가판','5','1003'),
                ('RA15','S071','pd048','한식전문점','1','1001'),
                ('RA15','S072','pd049','나주곰탕','2','1001'),
                ('RA15','S073','pd005','호두과자','3','1005'),
                ('RA15','S074','pd050','한식전문점','4','1001'),
                ('RA15','S075','pd051','양식전문점','5','1008'),
                ('RA16','S076','pd052','한식전문점','1','1001'),
                ('RA16','S077','pd076','한식전문점','2','1001'),
                ('RA16','S078','pd053','놀부부대찌개','3','1001'),
                ('RA16','S079','pd013','던킨도너츠','4','1005'),
                ('RA16','S080','pd054','한식전문점','5','1001'),
                ('RA17','S081','pd055','공주밤나무','1','1005'),
                ('RA17','S082','pd013','카페베네','2','1002'),
                ('RA17','S083','pd056','공주밤나무','3','1005'),
                ('RA17','S084','pd057','공주밤나무','4','1005'),
                ('RA17','S085','pd058','공차','5','1002'),
                ('RA18','S086','pd059','파스쿠치','1','1002'),
                ('RA18','S087','pd060','양식전문점','2','1008'),
                ('RA18','S088','pd061','한식전문점','3','1001'),
                ('RA18','S089','pd062','파스쿠치','4','1002'),
                ('RA18','S090','pd063','한식전문점','5','1001'),
                ('RA19','S091','pd064','애플돈가스','1','1003'),
                ('RA19','S092','pd013','할리스','2','1002'),
                ('RA19','S093','pd039','한식전문점','3','1001'),
                ('RA19','S094','pd065','의류매장01','4','1009'),
                ('RA19','S095','pd066','스낵(라면)','5','1003'),
                ('RA20','S096','pd067','내린천한식','1','1001'),
                ('RA20','S097','pd068','코바코 라면','2','1003'),
                ('RA20','S098','pd013','탐앤탐스','3','1002'),
                ('RA20','S099','pd069','바른김밥김선생','4','1003'),
                ('RA20','S100','pd070','내린천한식','5','1001'),
                ('RA21','S101','pd007','뽀끼뽀기','1','1003'),
                ('RA21','S102','pd013','할리스','2','1002'),
                ('RA21','S103','pd013','할리스','3','1002'),
                ('RA21','S104','pd005','호두과자','4','1005'),
                ('RA21','S105','pd005','호두과자','5','1005'),
                ('RA22','S106','pd071','별미우동','1','1001'),
                ('RA22','S107','pd005','한과','2','1005'),
                ('RA22','S108','pd007','가판','3','1005'),
                ('RA22','S109','pd072','롯데리아','4','1008'),
                ('RA22','S110','pd073','별미우동','5','1001'),
                ('RA23','S111','pd013','드롭탑','1','1002'),
                ('RA23','S112','pd013','드롭탑','2','1002'),
                ('RA23','S113','pd074','한식전문점','3','1001'),
                ('RA23','S114','pd007','델리쉐프','4','1005'),
                ('RA23','S115','pd076','코바코돈까스','5','1008'),
                ('RA24','S116','pd007','가판','1','1005'),
                ('RA24','S117','pd076','평창반상','2','1001'),
                ('RA24','S118','pd013','탐앤탐스','3','1002'),
                ('RA24','S119','pd005','호두과자','4','1005'),
                ('RA24','S120','pd013','탐앤탐스','5','1002');
            INSERT INTO productInfo (product_id, product_name, price) VALUES
                ('pd001','완제음료','1000'),('pd002','닭강정','3000'),
                ('pd003','만두(8개)','3000'),('pd004','야채청과','10000'),
                ('pd005','호도과자','4000'),('pd006','레몬티/드롭탑','4000'),
                ('pd007','소떡소떡','3500'),('pd008','빅수제어묵','3500'),
                ('pd009','만쥬리아','3500'),('pd010','옛날핫도그','3500'),
                ('pd011','단배추바지락된장국','7500'),('pd012','가락속풀이생라면','5000'),
                ('pd013','아메리카노','4100'),('pd014','공기밥(자율) ','1000'),
                ('pd016','뚝배기불고기 ','8000'),('pd017','해물순두부','7500'),
                ('pd018','순두부짬뽕','7000'),('pd019','사태김치찌개','7000'),
                ('pd020','안성국밥','8000'),('pd021','로띠번','2000'),
                ('pd022','소떡소떡','3500'),('pd023','수제돈가스우동정식','8000'),
                ('pd024','명품낙지덮밥','8000'),('pd025','1등급한우국밥','9000'),
                ('pd026','흑돼지김치찌개','7000'),('pd027','옛날제육덮밥','8000'),
                ('pd028','산채비빔밥','6000'),('pd029','진영단감왕갈비찜','8000'),
                ('pd030','충청도식돼지짜글이비빔밥','7500'),('pd031','돈육김치찌개','8000'),
                ('pd032','춘천막국수+현풍돈가스','7000'),('pd033','에쎄엣지필드 ','4500'),
                ('pd034','공기밥(자율) ','1000'),('pd035','가락속풀이생라면','4500'),
                ('pd036','사골육개장 ','7000'),('pd037','제육덮밥정식','7000'),
                ('pd038','코바코 수제등심돈가스','5600'),('pd039','돈가스','7000'),
                ('pd040','순두부찌개','6600'),('pd041','제육덮밥','8500'),
                ('pd042','비빔밥','8000'),('pd043','보성꼬막비빔밥','8000'),
                ('pd044','김치찌개','7500'),('pd045','순희치즈핫도그','3000'),
                ('pd046','차돌박이된장찌게','6800'),('pd047','로띠번','2000'),
                ('pd048','순창고추장돌솥비빔밥','8800'),('pd049','장터국밥','6000'),
                ('pd050','제육정식','7000'),('pd051','김치찌개','6000'),
                ('pd052','돼지돈가스[8000]','8000'),('pd053','묵은지꽁치찌개','7500'),
                ('pd054','놀부부대찌개','9300'),('pd055','뚝배기불고기','8500'),
                ('pd056','공주알밤빵(대) ','4000'),('pd057','공주알밤빵(선물용) 공주알밤빵(선물용)','10000'),
                ('pd058','공주군밤 ','3500'),('pd059','그린 밀크티 (L) ','4400'),
                ('pd060','ICE-얼그레이','4300'),('pd061','등심돈가스','6600'),
                ('pd062','제육돌솥비빔밥 제육돌솥비빔밥','6000'),('pd063','아이스녹차(커피니)','4100'),
                ('pd064','사골우거지국밥','6500'),('pd065','애플수제등심돈가스','7000'),
                ('pd066','의류','10000'),('pd067','라면정식','4500'),
                ('pd068','흑돼지김치제육덮밥(한)','4500'),('pd069','떡라면(아)','5000'),
                ('pd070','바른김밥(바)','3600'),('pd071','시래기국밥(한)','6600'),
                ('pd072','내촌한우국밥','8000'),('pd073','불고기버거세트','5600'),
                ('pd074','산들비빔밥','6500'),('pd075','버섯제육덮밥 ','6000'), 
                ('pd076','흑돼지돈가스','8000'),('pd077','소고기국밥','8300');";
        
    $res = mysqli_multi_query($conn, $sql);
    if ($res === TRUE) {
        echo "New record created successfully";
    } else {
        echo "Error inserting database: " . mysqli_error($conn);
    }
    
    mysqli_close($conn);
    ?>