<?php
    $servername = "localhost";
    $username = "root";
    $password = "";
    $dbname = "myDB";
    
    // Create connection
    $conn = mysqli_connect($servername, $username, $password, "myDB");
    // Check connection
    if (!$conn) {
      die("Connection failed: " . mysqli_connect_error());
    }
    

    
    // sql to create table
    $sql = "CREATE TABLE productInfo(
    product_id VARCHAR(6) PRIMARY KEY,
    product_name VARCHAR(30) NOT NULL,
    price int(6) UNSIGNED NOT NULL,
    reg_date TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
    );";
    
    $res = mysqli_query($conn, $sql);
    if ($res === TRUE) {
      echo "Table restareaInfo created successfully";
    } else {
      echo "Error creating table: " . mysqli_error($conn);
    }
    
    //insert data
    $sql = "
    INSERT INTO productInfo (product_id, product_name, price) VALUES
    ('pd001','완제음료','1000'),
  ('pd002','닭강정','3000'),
  ('pd003','만두(8개)','3000'),
  ('pd004','야채청과','10000'),
('pd005','호도과자','4000'),
('pd006','레몬티/드롭탑','4000'),
('pd007','소떡소떡','3500'),
('pd008','빅수제어묵','3500'),
('pd009','만쥬리아','3500'),
('pd010','옛날핫도그','3500'),
('pd011','단배추바지락된장국','7500'),
('pd012','가락속풀이생라면','5000'),
('pd013','아메리카노','4100'),
('pd014','공기밥(자율) ','1000'),
('pd016','뚝배기불고기 ','8000'),
('pd017','해물순두부','7500'),
('pd018','순두부짬뽕','7000'),
('pd019','사태김치찌개','7000'),
('pd020','안성국밥','8000'),
('pd021','로띠번','2000'),
('pd022','소떡소떡','3500'),
('pd023','수제돈가스우동정식','8000'),
('pd024','명품낙지덮밥','8000'),
('pd025','1등급한우국밥','9000'),
('pd026','흑돼지김치찌개','7000'),
('pd027','옛날제육덮밥','8000'),
('pd028','산채비빔밥','6000'),
('pd029','진영단감왕갈비찜','8000'),
('pd030','충청도식돼지짜글이비빔밥','7500'),
('pd031','돈육김치찌개','8000'),
('pd032','춘천막국수+현풍돈가스','7000'),
('pd033','에쎄엣지필드 ','4500'),
('pd034','공기밥(자율) ','1000'),
('pd035','가락속풀이생라면','4500'),
('pd036','사골육개장 ','7000'),
('pd037','제육덮밥정식','7000'),
('pd038','코바코 수제등심돈가스','5600'),
('pd039','돈가스','7000'),
('pd040','순두부찌개','6600'),
('pd041','제육덮밥','8500'),
('pd042','비빔밥','8000'),
('pd043','보성꼬막비빔밥','8000'),
('pd044','김치찌개','7500'),
('pd045','순희치즈핫도그','3000'),
('pd046','차돌박이된장찌게','6800'),
('pd047','로띠번','2000'),
('pd048','순창고추장돌솥비빔밥','8800'),
('pd049','장터국밥','6000'),
('pd050','제육정식','7000'),
('pd051','김치찌개','6000'),
('pd052','돼지돈가스[8000]','8000'),
('pd053','묵은지꽁치찌개','7500'),
('pd054','놀부부대찌개','9300'),
('pd055','뚝배기불고기','8500'),
('pd056','공주알밤빵(대) ','4000'),
('pd057','공주알밤빵(선물용) 공주알밤빵(선물용)','10000'),
('pd058','공주군밤 ','3500'),
('pd059','그린 밀크티 (L) ','4400'),
('pd060','ICE-얼그레이','4300'),
('pd061','등심돈가스','6600'),
('pd062','제육돌솥비빔밥 제육돌솥비빔밥','6000'),
('pd063','아이스녹차(커피니)','4100'),
('pd064','사골우거지국밥','6500'),
('pd065','애플수제등심돈가스','7000'),
('pd066','의류','10000'),
('pd067','라면정식','4500'),
('pd068','흑돼지김치제육덮밥(한)','4500'),
('pd069','떡라면(아)','5000'),
('pd070','바른김밥(바)','3600'),
('pd071','시래기국밥(한)','6600'),
('pd072','내촌한우국밥','8000'),
('pd073','불고기버거세트','5600'),
('pd074','산들비빔밥','6500'),
('pd075','버섯제육덮밥 ','6000'), 
('pd076','흑돼지돈가스','8000'),
  ('pd077','소고기국밥','8300');";

    $res = mysqli_query($conn, $sql);
    if ($res === TRUE) {
      echo "New record created successfully";
    } else {
        echo "Error inserting database: " . mysqli_error($conn);
    }
    
    mysqli_close($conn);
    ?>