<?php
    $servername = "localhost";
    $username = "root";
    $password = "";
    $dbname = "myDB";
    
    // Create connection
    $conn = mysqli_connect($servername, $username, $password, "myDB");
    // Check connection
    if (!$conn) {
      die("Connection failed: " . mysqli_connect_error());
    }
    

    
    // sql to create table
    $sql = "CREATE TABLE storeInfo(
    id VARCHAR(6) PRIMARY KEY,
    store_id VARCHAR(6) NOT NULL,
    product_id VARCHAR(6) NOT NULL,
    store_name VARCHAR(30) NOT NULL,
    rank INT(6) UNSIGNED NOT NULL,
    food_type INT(6) UNSIGNED NOT NULL,
    reg_date TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
    );";
    
    $res = mysqli_query($conn, $sql);
    if ($res === TRUE) {
      echo "Table restareaInfo created successfully";
    } else {
      echo "Error creating table: " . mysqli_error($conn);
    }
    
    //insert data
    $sql = "
    INSERT INTO storeInfo (id, store_id, product_id, store_name, rank, food_type) VALUES
    ('RA01','S001','pd001','파리바게트','1','1002'),
('RA01','S002','pd002','찹쌀닭강정','2','1005'),
('RA01','S003','pd003','신서방왕만두','3','1003'),
('RA01','S004','pd004','CU','4','1006'),
('RA01','S005','pd005','효원당','5','1003'),
('RA02','S006','pd006','드롭탑','1','1002'),
('RA02','S007','pd007','델리쉐프','2','1005'),
('RA02','S008','pd008','델리쉐프','3','1005'),
('RA02','S009','pd009','만쥬리아','4','1005'),
('RA02','S010','pd010','델리쉐프','5','1005'),
('RA03','S011','pd011','자율식당','1','1001'),
('RA03','S012','pd005','호도과자코너','2','1005'),
('RA03','S013','pd012','우동전문점','3','1004'),
('RA03','S014','pd013','할리스커피','4','1002'),
('RA03','S015','pd014','자율식당','5','1001'),
('RA04','S016','pd013','카페드롭탑','1','1002'),
('RA04','S017','pd015','한식전문점','2','1001'),
('RA04','S018','pd016','한식전문점','3','1001'),
('RA04','S019','pd017','미스터짬뽕라면','4','1007'),
('RA04','S020','pd018','한식전문점','5','1001'),
('RA05','S021','pd019','한식전문점','1','1001'),
('RA05','S022','pd013','할리스','2','1002'),
('RA05','S023','pd020','로띠번','3','1002'),
('RA05','S024','pd007','가판','4','1003'),
('RA05','S025','pd022','한식당','5','1001'),
('RA06','S026','pd023','한식전문점','1','1001'),
('RA06','S027','pd024','한식전문점','2','1001'),
('RA06','S028','pd005','호두코너','3','1005'),
('RA06','S029','pd013','커피딜라이트','4','1002'),
('RA06','S030','pd025','한식전문점','5','1001'),
('RA07','S031','pd013','할리스커피','1','1002'),
('RA07','S032','pd026','한식전문점','2','1001'),
('RA07','S033','pd007','즉석코너','3','1003'),
('RA07','S034','pd027','한식전문점','4','1001'),
('RA07','S035','pd076','한식전문점','5','1001'),
('RA08','S036','pd028','풍경마루','1','1001'),
('RA08','S037','pd013','탐앤탐스','2','1002'),
('RA08','S038','pd029','풍경마루','3','1001'),
('RA08','S039','pd030','풍경마루','4','1001'),
('RA08','S040','pd031','코바코','5','1001'),
('RA09','S041','pd032','죠이마트','1','1006'),
('RA09','S042','pd033','자율식당','2','1001'),
('RA09','S043','pd034','우동김밥전문점','3','1003'),
('RA09','S044','pd005','호도/잡화','4','1005'),
('RA09','S045','pd035','자율식당','5','1001'),
('RA10','S046','pd013','탐앤탐스','1','1002'),
('RA10','S047','pd036','한식전문점','2','1001'),
('RA10','S048','pd037','한식전문점','3','1001'),
('RA10','S049','pd007','열린매장','4','1005'),
('RA10','S050','pd076','한식전문점','5','1001'),
('RA11','S051','pd013','탐앤탐스','1','1002'),
('RA11','S052','pd038','한식전문점','2','1001'),
('RA11','S053','pd039','한식전문점','3','1001'),
('RA11','S054','pd007','열린매장','4','1005'),
('RA11','S055','pd076','한식전문점','5','1001'),
('RA12','S056','pd013','탐앤탐스','1','1002'),
('RA12','S057','pd039','한식전문점','2','1001'),
('RA12','S058','pd040','한식전문점','3','1001'),
('RA12','S059','pd013','탐앤탐스','4','1002'),
('RA12','S060','pd041','한식전문점','5','1001'),
('RA13','S061','pd042','한식전문점','1','1001'),
('RA13','S062','pd013','할리스','2','1002'),
('RA13','S063','pd043','한식전문점','3','1001'),
('RA13','S064','pd044','미스터톡톡','4','1005'),
('RA13','S065','pd039','한식전문점','5','1001'),
('RA14','S066','pd045','한식전문점','1','1001'),
('RA14','S067','pd013','리던','2','1002'),
('RA14','S068','pd046','로띠번','3','1002'),
('RA14','S069','pd047','한식전문점','4','1001'),
('RA14','S070','pd007','가판','5','1003'),
('RA15','S071','pd048','한식전문점','1','1001'),
('RA15','S072','pd049','나주곰탕','2','1001'),
('RA15','S073','pd005','호두과자','3','1005'),
('RA15','S074','pd050','한식전문점','4','1001'),
('RA15','S075','pd051','양식전문점','5','1008'),
('RA16','S076','pd052','한식전문점','1','1001'),
('RA16','S077','pd076','한식전문점','2','1001'),
('RA16','S078','pd053','놀부부대찌개','3','1001'),
('RA16','S079','pd013','던킨도너츠','4','1005'),
('RA16','S080','pd054','한식전문점','5','1001'),
('RA17','S081','pd055','공주밤나무','1','1005'),
('RA17','S082','pd013','카페베네','2','1002'),
('RA17','S083','pd056','공주밤나무','3','1005'),
('RA17','S084','pd057','공주밤나무','4','1005'),
('RA17','S085','pd058','공차','5','1002'),
('RA18','S086','pd059','파스쿠치','1','1002'),
('RA18','S087','pd060','양식전문점','2','1008'),
('RA18','S088','pd061','한식전문점','3','1001'),
('RA18','S089','pd062','파스쿠치','4','1002'),
('RA18','S090','pd063','한식전문점','5','1001'),
('RA19','S091','pd064','애플돈가스','1','1003'),
('RA19','S092','pd013','할리스','2','1002'),
('RA19','S093','pd039','한식전문점','3','1001'),
('RA19','S094','pd065','의류매장01','4','1009'),
('RA19','S095','pd066','스낵(라면)','5','1003'),
('RA20','S096','pd067','내린천한식','1','1001'),
('RA20','S097','pd068','코바코 라면','2','1003'),
('RA20','S098','pd013','탐앤탐스','3','1002'),
('RA20','S099','pd069','바른김밥김선생','4','1003'),
('RA20','S100','pd070','내린천한식','5','1001'),
('RA21','S101','pd007','뽀끼뽀기','1','1003'),
('RA21','S102','pd013','할리스','2','1002'),
('RA21','S103','pd013','할리스','3','1002'),
('RA21','S104','pd005','호두과자','4','1005'),
('RA21','S105','pd005','호두과자','5','1005'),
('RA22','S106','pd071','별미우동','1','1001'),
('RA22','S107','pd005','한과','2','1005'),
('RA22','S108','pd007','가판','3','1005'),
('RA22','S109','pd072','롯데리아','4','1008'),
('RA22','S110','pd073','별미우동','5','1001'),
('RA23','S111','pd013','드롭탑','1','1002'),
('RA23','S112','pd013','드롭탑','2','1002'),
('RA23','S113','pd074','한식전문점','3','1001'),
('RA23','S114','pd007','델리쉐프','4','1005'),
('RA23','S115','pd076','코바코돈까스','5','1008'),
('RA24','S116','pd007','가판','1','1005'),
('RA24','S117','pd076','평창반상','2','1001'),
('RA24','S118','pd013','탐앤탐스','3','1002'),
('RA24','S119','pd005','호두과자','4','1005'),
('RA24','S120','pd013','탐앤탐스','5','1002');";

    $res = mysqli_query($conn, $sql);
    if ($res === TRUE) {
      echo "New record created successfully";
    } else {
        echo "Error inserting database: " . mysqli_error($conn);
    }
    
    mysqli_close($conn);
    ?>